// 单个规格

const sku1 = {
    "sku_spec_info": [
        {
            "spec_default_name": "套餐类型",
            "spec_ids": [
                "1835970518770779",
                "1834688382863384"
            ],
            "spec_names": [
                "【买二加一 大半年用量】270g3瓶", "【贵在运费 单瓶装】270g1瓶"
            ],
            "select_spec_id": ""
        }
    ]
};

const sku2 = {
    "specs": [
        {
            "name": "套餐类型",
            "spec_items": [
                {
                    "id": "1835970518770779",
                    "name": "【买二加一 大半年用量】270g3瓶"
                }, {
                    "id": "1834688382863384", "name": "【贵在运费 单瓶装】270g1瓶"
                }
            ],
            "spec_type": 0
        }
    ],
    "skus": {
        "1834688382863384": {
            "sku_id": "3488406971815938",
            "user_min_limit": 1,
            "can_select": true
        },
        "1835970518770779": {
            "sku_id": "3488406971815682",
            "user_min_limit": 1,
            "can_select": true
        }
    }
}

// 多个规则

const sku3 = {
    "sku_spec_info": [
        {
            "spec_default_name": "颜色分类",
            "spec_ids": [
                "1831638366282832",
                "1831638366282848",
                "1831638366285008",
                "1831638366285024"
            ],
            "spec_names": [
                "2025新款#雪纱酒红拉花特大号",
                "2025新款#雪纱大红拉花特大号",
                "2025新款#love红色拉花#大号",
                "2025新款#红色金边拉花#大号"
            ],
            "select_spec_id": ""
        },
        {
            "spec_default_name": "数量",
            "spec_ids": [
                "1831638366285824",
                "1832258834974768",
                "1831638366285840",
                "1832258834975744",
                "1831638366285856",
                "1832258834975760"
            ],
            "spec_names": [
                "10个装#精美拉花",
                "16个装#精美拉花",
                "20个装#精美拉花",
                "24个装#精美拉花",
                "30个装#精美拉花",
                "32个装#精美拉花"
            ],
            "select_spec_id": ""
        }
    ]
}

const sku4 = {

    "specs": [
        {
            "name": "颜色分类",
            "spec_items": [
                {
                    "id": "1831638366282832",
                    "name": "2025新款#雪纱酒红拉花特大号"
                },
                {
                    "id": "1831638366282848",
                    "name": "2025新款#雪纱大红拉花特大号"
                },
                {
                    "id": "1831638366285008",
                    "name": "2025新款#love红色拉花#大号"
                },
                {
                    "id": "1831638366285024",
                    "name": "2025新款#红色金边拉花#大号"
                }
            ],
            "spec_type": 0
        },
        {
            "name": "数量",
            "spec_items": [
                {
                    "id": "1831638366285824",
                    "name": "10个装#精美拉花"
                },
                {
                    "id": "1832258834974768",
                    "name": "16个装#精美拉花"
                },
                {
                    "id": "1831638366285840",
                    "name": "20个装#精美拉花"
                },
                {
                    "id": "1832258834975744",
                    "name": "24个装#精美拉花"
                },
                {
                    "id": "1831638366285856",
                    "name": "30个装#精美拉花"
                },
                {
                    "id": "1832258834975760",
                    "name": "32个装#精美拉花"
                }
            ],
            "spec_type": 0
        }
    ],
    "skus": {
        "1831638366282832_1831638366285824": {
            "sku_id": "7545536849765138734",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282832_1831638366285840": {
            "sku_id": "7545536849765122350",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282832_1831638366285856": {
            "sku_id": "7545536849765105966",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282832_1832258834974768": {
            "sku_id": "7545536850350571786",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282832_1832258834975744": {
            "sku_id": "7545536850350555402",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282832_1832258834975760": {
            "sku_id": "7545536850350539018",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282848_1831638366285824": {
            "sku_id": "7545536849765089582",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282848_1831638366285840": {
            "sku_id": "7545536849765073198",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282848_1831638366285856": {
            "sku_id": "7545536849765056814",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282848_1832258834974768": {
            "sku_id": "7545536850350522634",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282848_1832258834975744": {
            "sku_id": "7545536850350506250",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366282848_1832258834975760": {
            "sku_id": "7545536850350489866",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285008_1831638366285824": {
            "sku_id": "7545536849765040430",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285008_1831638366285840": {
            "sku_id": "7545536849765024046",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285008_1831638366285856": {
            "sku_id": "7545536849765007662",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285008_1832258834974768": {
            "sku_id": "7545536850350473482",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285008_1832258834975744": {
            "sku_id": "7545536849765220654",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285008_1832258834975760": {
            "sku_id": "7545536849765204270",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285024_1831638366285824": {
            "sku_id": "7545536849764991278",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285024_1831638366285840": {
            "sku_id": "7545536849764974894",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285024_1831638366285856": {
            "sku_id": "7545536849764958510",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285024_1832258834974768": {
            "sku_id": "7545536849765187886",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285024_1832258834975744": {
            "sku_id": "7545536849765171502",
            "user_min_limit": 1,
            "can_select": true
        },
        "1831638366285024_1832258834975760": {
            "sku_id": "7545536849765155118",
            "user_min_limit": 1,
            "can_select": true
        }
    }

}